{
  "title": "Goedel Escher Bach",
  "author": "Unknown",
  "review_date": "2025-01-01",
  "description": "Book review, Goedel Escher Bach",
  "content": "## This was...\n\nThis book originally came to fame in the 90s. Now 20 years later due to the rise in artificial intelligence this book has become of conversation and interest again.\n\nFundamentally, the author makes reference to systems that refer to themselves. He sees this pattern in the work of Godel Escher and Bach. Godel makes some mathematical statements which refer to versions of themselves, Escher similar makes self referencing images, and Bach appears to make musical patterns which reference parts of themselves\n\nSince humans are able to reference to themselves where we do not see this elsewhere the author suggests that self referencing is a key function of artificial intelligence. While he spots that these systems are not intelligent he implies self reference may be emergent from a complex system.\n\n## I already knew...\n\nI had made thoughts about how humans are pattern recognising systems, recognising patterns within and without and overlapping each other, that intelligence was about pattern recognition.\n\n![Author reading 'Godel Escher Bach'](/images/Literature/GEBscale.JPG \"A heavy going read\")\n\nWhile this is not widely stated, it is clear that matrix maths enables pattern recognition much more effectively than other systems. We are of course neural networks which are functionally Matrix maths.\n\n## What was new...\n\nI learned a lot about Godel, Escher and Bach, And had more food for thought about understanding what is intelligence when it is synthetic.\n\n## I particularly liked...\n\nThe book carries conversations between a tortoise and a hair and in dialogue makes an entertaining description of the underlying points. If this weighty tome is too much for you, you might go a considerable way to understanding it simply by reading the comedy dialogues between these  characters.\n\n\n",
  "rating": null,
  "source_file": "Goedel Escher Bach.md"
}