{
  "title": "Python Crash Course",
  "author": "Unknown",
  "review_date": "2025-01-01",
  "description": "Book review, Python Crash Course, by Eric Mathes",
  "content": "## This was...\n\nThis is the all-time classic introduction book to Python and is where I started. I listen to a podcast interview featuring Eric Mathis, who is a teacher. He described learning programming as best done through projects and in this book he gives you three projects.\n\nIn the first project you use play game to create a simple arcade space invaders game. This helped me explore the game loop graphic boundaries, high scores and edge cases.\n\nThe second project was the use of Matt plot Lib and Webb API is to explore probabilities and statistics. I learned about application programming interfaces graph representation using plot and Matt plot live we also covered installing and loading, separated value data and a dose of probability. This was a nice exploration of additional topics above the opening chapters.\n\nThe third project was writing of a learning log using the Django Python web framework by the time I got to this I had already explored the pelican python static blog to it and also SQL alchemy, ginger to templating and Flask. I did not complete this chapter but would love to go back just for the learning.\n\n## I already knew...\n\nI came to Python mainly knowing some C+ plus having worked through.\"jumping into C++\"by Alex Allain. This previous work taught me a good deal about pointers references, loop structures and important programming basics such as modules, imports and other basic structures. This means when I came to Python and found I did not need to use pointers. I still understood what was going on in the background. I was aware of the need to allocate and delicate memory and what the difference was between a shallow and a deep copy. I feel this substantially improved what I could get from this basic Python introduction.\n\n## What was new...\n\nI certainly learnt more about using list slices. I learned a bit about using pie game and also Matt plot Lib, plot Lee. I would like to go back and complete the Django work.\n\n## I particularly liked...\n\nI really liked that. This was a straightforward project based introduction to programming in Python. Note that this was before large language models so all the basic mistakes and error solving I did on my own. I feel this gave me an advantage in learning Python.\n",
  "rating": null,
  "source_file": "Python Crash Course.md"
}