{
  "title": "The Prag Prog",
  "author": "Unknown",
  "review_date": "2025-01-01",
  "description": "Maintaining a sense of balance, proportion and professionalism",
  "content": "## This was...\n\nI had listened to an interview with the authors about their approach to programming being pragmatic and why they felt this was important to be learned by programmers. I was keen to explore my programming behaviours over and above learning loops and conditionals. I put this book on my wish list and when nobody bought it, I bought it for myself.\n\nthe content of the book is entirely reflected by the title and then also a little bit more. There are often decisions, design decisions and software decisions, even human interface decisions where the decision needs to be pragmatic over correct. Humans do not operate ideally, and we need to take account of this. The book goes beyond this and talks about applying professionalism to programming and developing tradecraft. It speaks about exploring deeply one area and honing the skill to Craftsmanship.\n\n## I already knew...\n\nhaving walked in the professional world both as a mechanical engineer and as a medic professionalism is not near to me. Learning how it applies in the career of programming is really interesting to see and there's lots of translations from my previous experience.\n\n## What was new...\n\nThere were several situations where I can loosely summarise the writing as saying don't let the great be the enemy of the good. This is to say perfect may well take a long time to implement and not give you the outputs for your use case. Good enough may actually be better in that the effort has been focused on the majority case and the end use your experience is better.\n\n## I particularly liked...\n\nI felt the discussive and interesting tone, along with references to experience made the text come alive and it was fun to read. As I read it, I felt I was walking alongside the authors and learning from their stories.\n",
  "rating": null,
  "source_file": "The Prag Prog.md"
}