{
  "title": "The Emporer'S New Mind",
  "author": "Unknown",
  "review_date": "2025-01-01",
  "description": "Book review, The Emporer's New Mind, by Roger Penrose",
  "content": "## This was...\n\n![New Clothes](/images/Literature/NewMind.JPG)\n\n## This was...\n\nRoger Penrose was maths comrade in arms to Stephen Hawking. This means they challenged each other's maths during their careers. This would be like a sparring partner but for mathematics. This book is Roger Penrose argument that there will never be true artificial intelligence.\n\nAs many authors in this area do he began by exploring cheering machines, chaos theory and number theory. The book is quite dense and it took me three attempts to work through it.\n\n## I already knew...\n\nI was already aware of some basic number theory, some basic chaos theory and the arguments surrounding artificial intelligence. The exploration of these topics I felt was probably deeper than they really needed to be and the pros was a little heavier than it had to be. However, the work is a thorough exploration of the premises leading to the conclusion.\n\n## What was new...\n\nIt felt satisfying to be told that that would never be artificial intelligence in the sense that we see human like behaviour and speech with a full self-awareness as we see on the television. It made me feel unique as a human.\n\nEven the most advanced large language models currently are at the end of the day just statistical guessing tools and do not have self-awareness as such. They often speak in the first person but this is a result of statistical guessing, and not an outcome of self-awareness.\n\nAs a counterpoint I might propose that since I am a neural network and large language models are artificial neural networks what then is the difference? If they are statistical guessing tools, then am I not to also a statistical guessing tool?\n\nThe chief defence is that I know for sure that I have self-awareness. But again the counterpoint of this is that some animals also appear to have some level of self-awareness, yet also some humans fail to truly demonstrate a reflective and self-aware ability? This is to say that biological neural networks have a broad range which overlaps with the output we see from artificial neural networks that are large language models.\n\n## I particularly liked...\n\nThe tone of the text has a gentle excitability and mild opinionatedness which both contribute to the voice.\n\nIt still, however, is a very weighty tome and took me three attempts to complete.\n",
  "rating": null,
  "source_file": "The Emporer's New Mind.md"
}